<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Str;

use App\Category;
use App\Quantity;
use App\Indicator;

class IndicatorSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $list = [
            'محور اصلاح ساختار سازمانی' => [
                'واﮔﺬارى واﺣﺪﻫﺎى ﻋﻤﻠﻴﺎﺗﻰ و ﺧﺪﻣﺎت دﺳﺘﮕﺎهﻫﺎى اﺟﺮاﻳﻰ ﺑﻪ ﺑﺨﺶ ﺧﺼﻮﺻﻰ و ﻣﺪﻳﺮﻳﺖ ﻣﺤﻠﻰ' => 30,
                'اجراى ضوابط سازماندهى واحدهاى عمومى' => 20,
                'كاهش تعداد پست هاى سازمانى دستگاه' => 20,
                'واگذارى وظايف و تفويض اختيارات به سطوح استانى و شهرستانى' => 20,
                'اجراى بخشنامه سامانه ملى مديريت ساختار دستگاه هاى اجرايى' => 25,
                'كاهش تعداد واحدهاى سازمانى و پستهاى مديريتى و سرپرستى' => 15,
            ],
            'محور توسعه دولت الکترونیک' => [
                'ﺗﺪوﻳﻦ ﺑﺮﻧﺎﻣﻪ اﺟﺮاﻳﻰ دﺳﺘﮕﺎه در ﺣﻮزه دوﻟﺖ اﻟﻜﺘﺮوﻧﻴﻚ' => 10,
                'اﻟﻜﺘﺮوﻧﻴﻜﻰ ﻛﺮدن ﺧﺪﻣﺎت دوﻟﺘﻰ(درﺧﻮاﺳﺖ ﺧﺪﻣﺎت)' => 10,
                'اﻟﻜﺘﺮوﻧﻴﻜﻰ ﻛﺮدن ﺧﺪﻣﺎت دوﻟﺘﻰ(ﺗﺤﻮﻳﻞ ﺧﺪﻣﺎت)' => 10,
                'اﻟﻜﺘﺮوﻧﻴﻜﻰ ﻛﺮدن ﺧﺪﻣﺎت دوﻟﺘﻰ(ﻛﻠﻴﻪ ﻓﺮآﻳﻨﺪﻫﺎى ﺧﺪﻣﺖ اﻋﻢ از درﺧﻮاﺳﺖ، ﺗﻮﻟﻴﺪ و ﺗﺤﻮﻳﻞ)' => 10,
                'اﺳﺘﻔﺎده از دﻓﺎﺗﺮ ﭘﻴﺸﺨﻮان در ارا ﺋﻪ ﺧﺪﻣﺖ' => 15,
                'اﺳﺘﺎﻧﺪاردﺳﺎزى ﺗﺎرﻧﻤﺎ(وب ﺳﺎﻳﺖ)' => 20,
                'اﺻﻼح ﻓﺮآﻳﻨﺪﻫﺎى اراﺋﻪ ﺧﺪﻣﺎت' => 30,
                'اﺳﺘﻔﺎده از ﻓﻨﺎورىﻫﺎى ﻧﻮﻳﻦ در اراﺋﻪ ﺧﺪﻣﺖ(ﻓﻨﺎورﻳﻬﺎى ﻫﻤﺮاه، ﺷﺒﻜﻪ ﻫﺎى اﺟﺘﻤﺎﻋﻰ و ﭘﻴﺎم رﺳﺎن ﻫﺎ)' => 10,
                'اراﺋﻪ ﺧﺪﻣﺎت در ﻣﻴﺰ ﺧﺪﻣﺖ' => 20,
                'ﺗﻮﺳﻌﻪ زﻳﺮﺳﺎﺧﺖ دوﻟﺖ اﻟﻜﺘﺮوﻧﻴﻜﻰ' => 15,
                'ﻣﺸﺎرﻛﺖ اﻟﻜﺘﺮوﻧﻴﻜﻰ ﺷﻬﺮوﻧﺪان در ﺳﻴﺎﺳﺖ ﻫﺎ، ﻓﺮآﻳﻨﺪﻫﺎ، ﺗﺼﻤﻴﻤﺎت و اﻗﺪاﻣﺎت دﺳﺘﮕﺎﻫﻬﺎى اﺟﺮاﻳﻰ' => 15,
                'اﺣﺮاز ﻫﻮﻳﺖ اﻟﻜﺘﺮوﻧﻴﻜﻰ' => 10,
            ],
            'محور مدیریت سرمایه انسانی' => [
                'ﺑﺮﻧﺎﻣﻪ رﻳﺰى ﻧﻴﺮوى اﻧﺴﺎﻧﻰ' => 15,
                'اﺳﺘﻘﺮار ﻧﻈﺎم اراﺋﻪ آﻣﺎر ﺑﺮﺧﻂ ﻧﻴﺮوى اﻧﺴﺎﻧﻰ' => 10,
                'ﺳﺎﻣﺎﻧﺪﻫﻰ و ﻣﺘﻨﺎﺳﺐ ﺳﺎزى ﻧﻴﺮوى اﻧﺴﺎﻧﻰ' => 30,
                'ﻛﻴﻔﻴﺖ ﻧﻈﺎم ﺟﺬب و اﺳﺘﺨﺪام در دﺳﺘﮕﺎﻫﻬﺎى اﺟﺮاﻳﻰ' => 10,
                'ﺗﻨﺎﺳﺐ ﺷﻐﻞ و ﺷﺎﻏﻞ' => 15,
                'اﺻﻼح و ﺑﺎزﻧﮕﺮى ﻣﺸﺎﻏﻞ' => 15,
                'رﻋﺎﻳﺖ ﻣﻘﺮرات ﺟﺒﺮان ﺧﺪﻣﺖ' => 10,
                'ﺷﺎﻳﺴﺘﻪ ﺳﺎﻻرى در اﻧﺘﺼﺎب ﻣﺪﻳﺮان و ﺑﻬﺮه ﮔﻴﺮى از ﺗﻮاﻧﻤﻨﺪى ﻫﺎى زﻧﺎن و ﺟﻮاﻧﺎن' => 20,
                'ﺛﺒﺖ اﻃﻼﻋﺎت ﻣﺎﻫﺎﻧﻪ ﺣﻘﻮق و ﻣﺰاﻳﺎى ﻣﻘﺎﻣﺎت، روﺳﺎ، ﻣﺪﻳﺮان و ﻛﺎرﻛﻨﺎن در ﺳﺎﻣﺎﻧﻪ ﺣﻘﻮق و ﻣﺰاﻳﺎ' => 20,
                'ﻧﻴﺎزﺳﻨﺠﻰ و ﻃﺮاﺣﻰ ﺑﺮﻧﺎﻣﻪ آﻣﻮزﺷﻰ' => 25,
                'اﺟﺮا و ارزﺷﻴﺎﺑﻰ دوره ﻫﺎى آﻣﻮزﺷﻰ ﻣﺪﻳﺮان و ﻛﺎرﻛﻨﺎن' => 15,
                'اﺟﺮاى ﻃﺮح ارزﻳﺎﺑﻰ و ﺗﺮﺑﻴﺖ ﻣﺪﻳﺮان' => 10,
                'ارزﺷﻴﺎﺑﻰ ﻋﻤﻠﻜﺮد ﻛﺎرﻛﻨﺎن' => 10,
            ],
            'محور شفافیت و مدیریت مالی' => [
                'اداره واﺣﺪﻫﺎى اﺟﺮاﻳﻰ ﺑﻪ روش ﻗﻴﻤﺖ ﺗﻤﺎم ﺷﺪه' => 25,
                'اﺟﺮاى ﺑﺮﻧﺎﻣﻪ ﻣﻠﻰ ﺗﻮﺳﻌﻪ آﻣﺎر ﻛﺸﻮر و ﻣﺪرن ﺳﺎزى ﻧﻈﺎم آﻣﺎرى' => 20,
                'اﺟﺮاى ﺣﺴﺎﺑﺪارى ﺗﻌﻬﺪى' => 25,
                'ﺑﻪ ﻛﺎرﮔﻴﺮى ﺳﺎﻣﺎﻧﻪ ﺗﺪارﻛﺎت اﻟﻜﺘﺮوﻧﻴﻜﻰ دوﻟﺖ(ﺳﺎﻣﺎﻧﻪ ﺳﺘﺎد)' => 20,
            ],
            'محور بهبود فضای کسب و کار و ارتقای بهره وری' => [
                'اﺻﻼح ﻧﻈﺎم ﻣﺠﻮزدﻫﻰ ﻛﺸﻮر' => 25,
                'اﺳﺘﻘﺮار ﭼﺮﺧﻪ ﺑﻬﺮهورى در دﺳﺘﮕﺎهﻫﺎى اﺟﺮاﻳﻰ ﻛﺸﻮر' => 25,
                'ﺛﺒﺖ اﻃﻼﻋﺎت ﻓﻀﺎﻫﺎى ادارى در ﺳﺎﻣﺎﻧﻪ ﺳﺎدا(ﺳﺎﻣﺎﻧﻪ اﻣﻮال دﺳﺘﮕﺎﻫﻬﺎى اﺟﺮاﻳﻰ)' => 15,
                'اﺟﺮاى ﺑﺮﻧﺎﻣﻪ ﻣﺪﻳﺮﻳﺖ ﺳﺒﺰ' => 20,
            ],
            'محور ارتقا سلامت اداری، مسئولیت پذیری و پاسخگویی' => [
                'ارﺗﻘﺎء ﺳﻼﻣﺖ ﻧﻈﺎم ادارى' => 35,
                'ﺻﻴﺎﻧﺖ از ﺣﻘﻮق ﺷﻬﺮوﻧﺪان در ﻧﻈﺎم ادارى' => 35,
                'اﻓﺰاﻳﺶ اﺛﺮﺑﺨﺸﻰ ﻧﻈﺎم رﺳﻴﺪﮔﻰ ﺑﻪ ﺗﺨﻠﻔﺎت ادارى' => 15,
                'رﺳﻴﺪﮔﻰ ﺑﻪ ارﺗﺒﺎﻃﺎت ﻣﺮدﻣﻰ در ﺑﺴﺘﺮ ﺳﺎﻣﺪ' => 15,
                'ارﺗﺒﺎﻃﺎت ﻣﺮدم و دوﻟﺖ در ﺑﺴﺘﺮ ﺳﺎﻣﺪ' => 20,
                'ﻣﻨﺎﺳﺐ ﺳﺎزى ﻓﻀﺎﻫﺎى ادارى ﺟﻬﺖ اﺳﺘﻔﺎده ﻣﻌﻠﻮﻟﻴﻦ و ﺟﺎﻧﺒﺎزان' => 20,
            ],
            'محور توسعه فرهنگ سازمانی' => [
                'اﺳﺘﻘﺮار ﻧﻈﺎم ﺟﺎﻣﻊ ﺗﻮﺳﻌﻪ و ﺗﺮوﻳﺞ ﻓﺮﻫﻨﮓ اﻗﺎﻣﻪ ﻧﻤﺎز' => 20,
                'اﺟﺮاى ﻣﻔﺎد ﻧﻈﺎم ﻧﺎﻣﻪ ﻣﺪﻳﺮﻳﺖ ﺗﻮﺳﻌﻪ ﻓﺮﻫﻨﮓ ﺳﺎزﻣﺎﻧﻰ' => 15,
                'ارﺗﻘﺎء ﺳﻄﺢ ﻓﺮﻫﻨﮓ ﺳﺎزﻣﺎﻧﻰ دﺳﺘﮕﺎه' => 10,
                'ﺗﺮوﻳﺞ ﻓﺮﻫﻨﮓ اﻳﺜﺎر و ﺷﻬﺎدت' => 10,
            ],
            'محور استقرار نظام مدیریت عملکرد' => [
                'اﻧﺠﺎم ارزﻳﺎﺑﻰ ﻋﻤﻠﻜﺮد دﺳﺘﮕﺎه' => 40,
                'ﺗﻬﻴﻪ و ﺗﺪوﻳﻦ ﮔﺰارش ارزﻳﺎﺑﻰ اﺳﺘﺮاﺗﮋﻳﻚ دﺳﺘﮕﺎه' => 20,
                'ﺗﺸﻜﻴﻞ ﺷﻮراى راﻫﺒﺮى ﺗﻮﺳﻌﻪ ﻣﺪﻳﺮﻳﺖ دﺳﺘﮕﺎه' => 20,
                'اﻓﺰاﻳﺶ ﻣﻴﺰان رﺿﺎﻳﺘﻤﻨﺪى ﻣﺮدم از ﺧﺪﻣﺎت دﺳﺘﮕﺎه اﺟﺮاﻳﻰ' => 40,
            ],
        ];

        foreach ($list as $category_name => $indicators_list) {

            $category = Category::create([
                'name' => $category_name
            ]);

            foreach ($indicators_list as $title => $points) {

                Indicator::create([
                    'category_id' => $category->id,
                    'title' => $title,
                    'points' => $points,
                ]);

            }

        }
    }
}
