<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Str;

use App\Category;
use App\Quantity;
use App\Indicator;

class IndicatorSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $list = [
            'محور اصلاح ساختار سازمانی' => [
                'واﮔﺬارى واﺣﺪﻫﺎى ﻋﻤﻠﻴﺎﺗﻰ و ﺧﺪﻣﺎت دﺳﺘﮕﺎهﻫﺎى اﺟﺮاﻳﻰ ﺑﻪ ﺑﺨﺶ ﺧﺼﻮﺻﻰ و ﻣﺪﻳﺮﻳﺖ ﻣﺤﻠﻰ' => 30,
                'اجراى ضوابط سازماندهى واحدهاى عمومى' => 20,
                'كاهش تعداد پست هاى سازمانى دستگاه' => 20,
                'واگذارى وظايف و تفويض اختيارات به سطوح استانى و شهرستانى' => 20,
                'اجراى بخشنامه سامانه ملى مديريت ساختار دستگاه هاى اجرايى' => 25,
                'كاهش تعداد واحدهاى سازمانى و پستهاى مديريتى و سرپرستى' => 15,
            ],
            'محور توسعه دولت الکترونیک' => [
                'ﺗﺪوﻳﻦ ﺑﺮﻧﺎﻣﻪ اﺟﺮاﻳﻰ دﺳﺘﮕﺎه در ﺣﻮزه دوﻟﺖ اﻟﻜﺘﺮوﻧﻴﻚ' => 10,
                'اﻟﻜﺘﺮوﻧﻴﻜﻰ ﻛﺮدن ﺧﺪﻣﺎت دوﻟﺘﻰ(درﺧﻮاﺳﺖ ﺧﺪﻣﺎت)' => 10,
                'اﻟﻜﺘﺮوﻧﻴﻜﻰ ﻛﺮدن ﺧﺪﻣﺎت دوﻟﺘﻰ(ﺗﺤﻮﻳﻞ ﺧﺪﻣﺎت)' => 10,
                'اﻟﻜﺘﺮوﻧﻴﻜﻰ ﻛﺮدن ﺧﺪﻣﺎت دوﻟﺘﻰ(ﻛﻠﻴﻪ ﻓﺮآﻳﻨﺪﻫﺎى ﺧﺪﻣﺖ اﻋﻢ از درﺧﻮاﺳﺖ، ﺗﻮﻟﻴﺪ و ﺗﺤﻮﻳﻞ)' => 10,
                'اﺳﺘﻔﺎده از دﻓﺎﺗﺮ ﭘﻴﺸﺨﻮان در ارا ﺋﻪ ﺧﺪﻣﺖ' => 15,
                'اﺳﺘﺎﻧﺪاردﺳﺎزى ﺗﺎرﻧﻤﺎ(وب ﺳﺎﻳﺖ)' => 20,
                'اﺻﻼح ﻓﺮآﻳﻨﺪﻫﺎى اراﺋﻪ ﺧﺪﻣﺎت' => 30,
                'اﺳﺘﻔﺎده از ﻓﻨﺎورىﻫﺎى ﻧﻮﻳﻦ در اراﺋﻪ ﺧﺪﻣﺖ(ﻓﻨﺎورﻳﻬﺎى ﻫﻤﺮاه، ﺷﺒﻜﻪ ﻫﺎى اﺟﺘﻤﺎﻋﻰ و ﭘﻴﺎم رﺳﺎن ﻫﺎ)' => 10,
                'اراﺋﻪ ﺧﺪﻣﺎت در ﻣﻴﺰ ﺧﺪﻣﺖ' => 20,
                'ﺗﻮﺳﻌﻪ زﻳﺮﺳﺎﺧﺖ دوﻟﺖ اﻟﻜﺘﺮوﻧﻴﻜﻰ' => 15,
                'ﻣﺸﺎرﻛﺖ اﻟﻜﺘﺮوﻧﻴﻜﻰ ﺷﻬﺮوﻧﺪان در ﺳﻴﺎﺳﺖ ﻫﺎ، ﻓﺮآﻳﻨﺪﻫﺎ، ﺗﺼﻤﻴﻤﺎت و اﻗﺪاﻣﺎت دﺳﺘﮕﺎﻫﻬﺎى اﺟﺮاﻳﻰ' => 15,
                'اﺣﺮاز ﻫﻮﻳﺖ اﻟﻜﺘﺮوﻧﻴﻜﻰ' => 10,
            ],
            'محور مدیریت سرمایه انسانی' => [
                'ﺑﺮﻧﺎﻣﻪ رﻳﺰى ﻧﻴﺮوى اﻧﺴﺎﻧﻰ' => 15,
                'اﺳﺘﻘﺮار ﻧﻈﺎم اراﺋﻪ آﻣﺎر ﺑﺮﺧﻂ ﻧﻴﺮوى اﻧﺴﺎﻧﻰ' => 10,
                'ﺳﺎﻣﺎﻧﺪﻫﻰ و ﻣﺘﻨﺎﺳﺐ ﺳﺎزى ﻧﻴﺮوى اﻧﺴﺎﻧﻰ' => 30,
                'ﻛﻴﻔﻴﺖ ﻧﻈﺎم ﺟﺬب و اﺳﺘﺨﺪام در دﺳﺘﮕﺎﻫﻬﺎى اﺟﺮاﻳﻰ' => 10,
                'ﺗﻨﺎﺳﺐ ﺷﻐﻞ و ﺷﺎﻏﻞ' => 15,
                'اﺻﻼح و ﺑﺎزﻧﮕﺮى ﻣﺸﺎﻏﻞ' => 15,
                'رﻋﺎﻳﺖ ﻣﻘﺮرات ﺟﺒﺮان ﺧﺪﻣﺖ' => 10,
                'ﺷﺎﻳﺴﺘﻪ ﺳﺎﻻرى در اﻧﺘﺼﺎب ﻣﺪﻳﺮان و ﺑﻬﺮه ﮔﻴﺮى از ﺗﻮاﻧﻤﻨﺪى ﻫﺎى زﻧﺎن و ﺟﻮاﻧﺎن' => 20,
                'ﺛﺒﺖ اﻃﻼﻋﺎت ﻣﺎﻫﺎﻧﻪ ﺣﻘﻮق و ﻣﺰاﻳﺎى ﻣﻘﺎﻣﺎت، روﺳﺎ، ﻣﺪﻳﺮان و ﻛﺎرﻛﻨﺎن در ﺳﺎﻣﺎﻧﻪ ﺣﻘﻮق و ﻣﺰاﻳﺎ' => 20,
                'ﻧﻴﺎزﺳﻨﺠﻰ و ﻃﺮاﺣﻰ ﺑﺮﻧﺎﻣﻪ آﻣﻮزﺷﻰ' => 25,
                'اﺟﺮا و ارزﺷﻴﺎﺑﻰ دوره ﻫﺎى آﻣﻮزﺷﻰ ﻣﺪﻳﺮان و ﻛﺎرﻛﻨﺎن' => 15,
                'اﺟﺮاى ﻃﺮح ارزﻳﺎﺑﻰ و ﺗﺮﺑﻴﺖ ﻣﺪﻳﺮان' => 10,
                'ارزﺷﻴﺎﺑﻰ ﻋﻤﻠﻜﺮد ﻛﺎرﻛﻨﺎن' => 10,
            ],
            'محور شفافیت و مدیریت مالی' => [
                'اداره واﺣﺪﻫﺎى اﺟﺮاﻳﻰ ﺑﻪ روش ﻗﻴﻤﺖ ﺗﻤﺎم ﺷﺪه' => 25,
                'اﺟﺮاى ﺑﺮﻧﺎﻣﻪ ﻣﻠﻰ ﺗﻮﺳﻌﻪ آﻣﺎر ﻛﺸﻮر و ﻣﺪرن ﺳﺎزى ﻧﻈﺎم آﻣﺎرى' => 20,
                'اﺟﺮاى ﺣﺴﺎﺑﺪارى ﺗﻌﻬﺪى' => 25,
                'ﺑﻪ ﻛﺎرﮔﻴﺮى ﺳﺎﻣﺎﻧﻪ ﺗﺪارﻛﺎت اﻟﻜﺘﺮوﻧﻴﻜﻰ دوﻟﺖ(ﺳﺎﻣﺎﻧﻪ ﺳﺘﺎد)' => 20,
            ],
            'محور بهبود فضای کسب و کار و ارتقای بهره وری' => [
                'اﺻﻼح ﻧﻈﺎم ﻣﺠﻮزدﻫﻰ ﻛﺸﻮر' => 25,
                'اﺳﺘﻘﺮار ﭼﺮﺧﻪ ﺑﻬﺮهورى در دﺳﺘﮕﺎهﻫﺎى اﺟﺮاﻳﻰ ﻛﺸﻮر' => 25,
                'ﺛﺒﺖ اﻃﻼﻋﺎت ﻓﻀﺎﻫﺎى ادارى در ﺳﺎﻣﺎﻧﻪ ﺳﺎدا(ﺳﺎﻣﺎﻧﻪ اﻣﻮال دﺳﺘﮕﺎﻫﻬﺎى اﺟﺮاﻳﻰ)' => 15,
                'اﺟﺮاى ﺑﺮﻧﺎﻣﻪ ﻣﺪﻳﺮﻳﺖ ﺳﺒﺰ' => 20,
            ],
            'محور ارتقا سلامت اداری، مسئولیت پذیری و پاسخگویی' => [
                'ارﺗﻘﺎء ﺳﻼﻣﺖ ﻧﻈﺎم ادارى' => 35,
                'ﺻﻴﺎﻧﺖ از ﺣﻘﻮق ﺷﻬﺮوﻧﺪان در ﻧﻈﺎم ادارى' => 35,
                'اﻓﺰاﻳﺶ اﺛﺮﺑﺨﺸﻰ ﻧﻈﺎم رﺳﻴﺪﮔﻰ ﺑﻪ ﺗﺨﻠﻔﺎت ادارى' => 15,
                'رﺳﻴﺪﮔﻰ ﺑﻪ ارﺗﺒﺎﻃﺎت ﻣﺮدﻣﻰ در ﺑﺴﺘﺮ ﺳﺎﻣﺪ' => 15,
                'ارﺗﺒﺎﻃﺎت ﻣﺮدم و دوﻟﺖ در ﺑﺴﺘﺮ ﺳﺎﻣﺪ' => 20,
                'ﻣﻨﺎﺳﺐ ﺳﺎزى ﻓﻀﺎﻫﺎى ادارى ﺟﻬﺖ اﺳﺘﻔﺎده ﻣﻌﻠﻮﻟﻴﻦ و ﺟﺎﻧﺒﺎزان' => 20,
            ],
            'محور توسعه فرهنگ سازمانی' => [
                'اﺳﺘﻘﺮار ﻧﻈﺎم ﺟﺎﻣﻊ ﺗﻮﺳﻌﻪ و ﺗﺮوﻳﺞ ﻓﺮﻫﻨﮓ اﻗﺎﻣﻪ ﻧﻤﺎز' => 20,
                'اﺟﺮاى ﻣﻔﺎد ﻧﻈﺎم ﻧﺎﻣﻪ ﻣﺪﻳﺮﻳﺖ ﺗﻮﺳﻌﻪ ﻓﺮﻫﻨﮓ ﺳﺎزﻣﺎﻧﻰ' => 15,
                'ارﺗﻘﺎء ﺳﻄﺢ ﻓﺮﻫﻨﮓ ﺳﺎزﻣﺎﻧﻰ دﺳﺘﮕﺎه' => 10,
                'ﺗﺮوﻳﺞ ﻓﺮﻫﻨﮓ اﻳﺜﺎر و ﺷﻬﺎدت' => 10,
            ],
            'محور استقرار نظام مدیریت عملکرد' => [
                'اﻧﺠﺎم ارزﻳﺎﺑﻰ ﻋﻤﻠﻜﺮد دﺳﺘﮕﺎه' => 40,
                'ﺗﻬﻴﻪ و ﺗﺪوﻳﻦ ﮔﺰارش ارزﻳﺎﺑﻰ اﺳﺘﺮاﺗﮋﻳﻚ دﺳﺘﮕﺎه' => 20,
                'ﺗﺸﻜﻴﻞ ﺷﻮراى راﻫﺒﺮى ﺗﻮﺳﻌﻪ ﻣﺪﻳﺮﻳﺖ دﺳﺘﮕﺎه' => 20,
                'اﻓﺰاﻳﺶ ﻣﻴﺰان رﺿﺎﻳﺘﻤﻨﺪى ﻣﺮدم از ﺧﺪﻣﺎت دﺳﺘﮕﺎه اﺟﺮاﻳﻰ' => 40,
            ],

            'بهداشت و درمان' => [
                'میزان پوشش خدمات کمیسیون پزشکی به کل واجدین شرایط ثبت شده در سیستم سجایا' => 50,
                'متوسط دوره انتظار ارائه خدمات کمیسیون پزشکی واجدین ثبت شده ( معکوس )' => 50,
                'درصدپوشش دریافت کنندگان خدمات بیمه درمان ایثارگران مشمول' => 100,
                'درصد پوشش خدمات پایش سلامت جانبازان و والدین شهدا مشمول طرح' => 50,
                'رعایت دوره انتظار دریافت کنندگان تجهیزات توانبخشی بر طبق دوره انتظار ' => 50,
            ],

            'تملک دارایی سرمایه ای' => [
                'تعداد ایثارگران دریافت کننده تسهیلات مسکن ' => 50,
            ],

            'فرهنگی و پژوهشی' => [
                'نسبت رشد خدمات گیرندگان مستمر خدمات ورزشی (تمرینات) به سال قبل ' => 50,
                'رشد تعداد خدمات گیرندگان (اردوهای سیاحتی ، زیارتی) به تعداد جمعیت هدف نسبت به سال قبل' => 45,
                'میزان رشد طرح ها و تولید و اجرای آثارنمایشی و تولید برنامه های رادیویی، تلویزیونی ، سینمایی با رویکرد فرهنگ ایثار و شهادت نسبت به سال قبل' => 45,
                'میزان رضایت دانش آموزان و دانشجویان ممتاز از خدمات بنیاد (از طریق نظرسنجی )' => 40,
                'درصد  رشد دانشجویان و دانش آموزان ممتاز به کل دانشجویان و دانش آموزان مشمول' => 35,
                'درصد رشد شرکت کنندگان در مراسم و برنامه های فرهنگی (یادواره ها ، حسینیه ها ، خانه ها و مراکز فرهنگی ) به سال قبل ' => 45,
                'میزان رشد آموزش گیرندگان و شرکت کنندگان در برنامه های قرآنی جامعه هدف نسبت به سال قبل' => 50,
                'میزان رشد تبلیغات محیطی (میزان افزایش کمی تعداد طرحهای حجمی،نقاشی دیواری ، تابلوهای تبلیغی و نام گذاری ها و نمایشگاه ها) در طی سال نسبت به سال قبل' => 40,
            ],


            'محور حمایت های اجتماعی' => [
                'تعداد  اشتغال ایجاد شده (استخدام وخوداشتغالی )  برای ایثارگران وخانواده های آنان  ' => 55,
                ' تعداد ایثارگران  وخانواده های بهره منداز پوشش خدمات بیمه های اجتماعی(عمروحادثه)و(حوادث غیرمترقبه)' => 60,
                ' تعداد دیدار و مراجعه به ایثارگران وخانواده های آنان در اجرای طرح سپاس ' => 50,
                'تعداد  ایثارگران وخانواده های بهره مند از مشاوره ' => 45,
                'تعداد  ایثارگران وخانواده های  بهره مند از آموزش وپیشگیری  از آسیب های اچتماعی ' => 40,
                'تعداد  ایثارگران وخانواده های بهره مند از خدمات مددکاری فردی' => 50,
            ],

        ];

        $i = 0;
        foreach ($list as $category_name => $indicators_list) {

            $i++;

            $category = Category::create([
                'name' => $category_name,
                'type' => $i > 8 ? 2 : 1
            ]);

            foreach ($indicators_list as $title => $points) {

                Indicator::create([
                    'category_id' => $category->id,
                    'title' => $title,
                    'points' => $points,
                ]);

            }

        }
    }
}
